# 1. Задание

a = int(input("Введите четырехзначное число: "))
print("Сумма цифр числа: ", a %10 + a %100 //10 + a %1000 //100 + a %10000 //1000)


# 2. Задание

num1 = int(input("Введите первое число: "))
num2 = int(input("Введите второе число: "))

print("Результат:", end="")
print(num1 * num2, num1, num2, sep="-")

# 3. Задание

n1 = int(input("Введите первое число: "))
n2 = int(input("Введите второе число: "))
rem_num= n1 - (n2 * int(n1 / n2))
int_num = int(n1 /n2)

print("Остаток от деления: ", rem_num)
print("Целочисленное деление: ", int_num)

